src/cf/src/Tasks/ЗадачиПользователя/ЗадачиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачиПользователя</name>
  <comment>Service Desk</comment>
  <basedOn>Catalog.РабочиеМеста</basedOn>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийИдентификатор</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителейЗадач</name>
    <type>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала выполнения задачи - для приоритезации исполнителем своих задач</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОценкиЗадачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияКИсполнению</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурационнаяЕдиница</name>
    <type>
      <types>CatalogRef.КонфигурационныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Оповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокТрудозатратДляПриоритизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтмененаЗадача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаЗадачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПамятнаяДата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательУслуг</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятаКИсполнению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентЗавершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентЗавершенияДляПриоритизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяГруппаСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОповещения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПользователей</name>
    <comment>В качестве типа используется пустая ссылка</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Трудоемкость</name>
    <type>
      <types>DefinedType.ТрудоемкостьЧасовНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыНаОценку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланНаСпринт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПлановые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПредварительные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелОбмена</name>
    <comment>Идентификатор узла обмена распределенной базы данных плана обмена &quot;ОбменВРаспределеннойИнформационнойБазе&quot;</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочаяГруппа</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ВнешниеПользователи</types>
        <types>CatalogRef.ГруппыВнешнихПользователей</types>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>ТипРаботы</name>
      <type>
        <types>EnumRef.ТипыРаботПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрудозатратыПлановые</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

src/cf/src/InformationRegisters/ТекущиеСостоянияЗадач/ТекущиеСостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеСостоянияЗадач</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СостоянияЗадач</types>
    </type>
  </resources>
  <resources>
    <name>СтатусОбработки</name>
    <type>
      <types>CatalogRef.СтатусыОбработкиЗадач</types>
    </type>
  </resources>
  <resources>
    <name>СрокСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаСостояния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Catalogs/СостоянияЗадач/СостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗадач</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>Зарегистрирована</name>
      <description>Зарегистрирована</description>
    </items>
    <items>
      <name>НаБизнесТестировании</name>
      <description>На бизнес-тестировании</description>
    </items>
    <items>
      <name>НаУточнении</name>
      <description>На уточнении</description>
    </items>
    <items>
      <name>НоваяЗадача</name>
      <description>Новая задача</description>
    </items>
    <items>
      <name>ОжиданиеПереносаИзменений</name>
      <description>Ожидание переноса изменений в продуктив</description>
    </items>
    <items>
      <name>ОтмененоВыполнение</name>
      <description>Отменено выполнение</description>
    </items>
    <items>
      <name>Приостановлена</name>
      <description>Приостановлена</description>
    </items>
    <items>
      <name>Согласование</name>
      <description>Согласование</description>
    </items>
    <items>
      <name>ФормированиеТехническогоРешения</name>
      <description>Формирование тех. решения</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенСрокСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательнаПричинаИзмененияСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения100</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПриРасчетеВремениВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаСостояния</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменятьТекстЦвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Tasks/ЗадачиПользователя/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполнить задачу ЗадачаСсылка, при необходимости выполнив обработчик
// ОбработкаВыполненияПоУмолчанию модуля менеджера бизнес-процесса, 
// к которому относится задача ЗадачаСсылка.
//
Процедура ВыполнитьЗадачу(ЗадачаСсылка, ДействиеПоУмолчанию = Ложь) Экспорт
	
	РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗадачаСсылка,"Исполнитель,Инициатор,Проект");
	
	Если Не ЕстьДоступНаВыполненияЗадачи(РеквизитыЗадачи) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Задача не выполнена, т.к. пользователь не является ни автором ни исполнителем задачи.'"));
		Возврат;
	КонецЕсли;
	
	Если РеквизитыЗадачи.Проект.Пустая() 
		И РаботаСЗадачами.ЭтоПолноправныйПользовательЗадач() Тогда
		ОбщегоНазначения.СообщитьПользователю(
		    НСтр("ru = 'Поле ""Проект"" не заполнено у выполняемой задачи.'"));
		Возврат;	
	КонецЕсли;	
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Задача.ЗадачиПользователя");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ЗадачаСсылка);
		Блокировка.Заблокировать();
		
		ЗадачаОбъект = ЗадачаСсылка.ПолучитьОбъект();
		ЗадачаОбъект.Прочитать();
		ЗадачаОбъект.ДатаВыполнения = ТекущаяДата();	
		ЗадачаОбъект.Выполнена = Ложь;
		ЗадачаОбъект.ОтмененаЗадача = Ложь;  //!
		ЗадачаОбъект.ВыполнитьЗадачу();
		
		// обновление текущего состояния в регистре
		РегистрыСведений.ТекущиеСостоянияЗадач.ОбновитьТекущееСостояниеЗадачи(ЗадачаСсылка,Справочники.СостоянияЗадач.Выполнена);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Функция ПечатьКарточкиЗадачи(МассивОбъектов, ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачиПользователя.Важность,
	|	ЗадачиПользователя.Выполнена,
	|	ЗадачиПользователя.Дата,
	|	ЗадачиПользователя.ДатаВыполнения,
	|	ЗадачиПользователя.ПолучательУслуг КАК Инициатор,
	|	ЗадачиПользователя.Исполнитель,
	|	ЗадачиПользователя.Наименование,
	|	ЗадачиПользователя.Номер,
	|	ЗадачиПользователя.Описание,
	|	ЗадачиПользователя.Ответ,
	|	ЗадачиПользователя.ПроцентЗавершения,
	|	ЗадачиПользователя.СрокИсполнения,
	|	ЗадачиПользователя.Трудоемкость,
	|	ЗадачиПользователя.РабочаяГруппа.(
	|		Пользователь
	|	),
	|	ЗадачиПользователя.Проект,
	|	ЗадачиПользователя.ДатаНачала,
	|	ЗадачиПользователя.Основание
	|ИЗ
	|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	|ГДЕ
	|	ЗадачиПользователя.Ссылка В(&МассивОбъектов)";
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗадачиПользователя_КарточкаЗадачи";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Задача.ЗадачиПользователя.Печать");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСогласованиеШапка = Макет.ПолучитьОбласть("СогласованиеШапка");
	ОбластьСогласование = Макет.ПолучитьОбласть("Согласование");
	ОбластьРезультат = Макет.ПолучитьОбласть("Результат");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДокумент.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Шапка, Выборка.Уровень());

		ВыборкаСогласование = Выборка.РабочаяГруппа.Выбрать();
		Если ВыборкаСогласование.Количество()>0 Тогда
			ТабДокумент.Вывести(ОбластьСогласованиеШапка);
			Пока ВыборкаСогласование.Следующий() Цикл
				ОбластьСогласование.Параметры.Заполнить(ВыборкаСогласование);
				ТабДокумент.Вывести(ОбластьСогласование, ВыборкаСогласование.Уровень());
			КонецЦикла;
		КонецЕсли;
		
		Если СокрЛП(Выборка.Ответ)<>"" Тогда
			ОбластьРезультат.Параметры.Заполнить(Выборка);
			ТабДокумент.Вывести(ОбластьРезультат);
		КонецЕсли;
		
		ОбластьПодвал.Параметры.Заполнить(Выборка);
		
		ОбластьПодвал.Рисунки.ЗадачаВыполнена.Картинка = ?(Выборка.Выполнена,БиблиотекаКартинок.Успешно32,БиблиотекаКартинок.Информация32);
		
		ТабДокумент.Вывести(ОбластьПодвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//////////////////////////////////////////////////////////////////////////////////////////
// БСП

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	// АПК:246-выкл Подсказка для прав 
	// Чтение
	//#ПоЗначениямРасширенный( "Задача.ЗадачиПользователя", "", "",
	//"Левое Соединение Задача.ЗадачиПользователя.РабочаяГруппа КАК Т2 по Т.Ссылка = Т2.Ссылка",
	//"",
	//"Организации","Т.Проект.Организация","И",
	//"Проекты","Т.Проект","И (",
	//"Пользователи","Т.Инициатор","ИЛИ",
	//"Пользователи","Т.ПолучательУслуг","ИЛИ",
	//"Пользователи","Т.Исполнитель","ИЛИ",
	//"Пользователи","Т.ГруппаИсполнителейЗадач","ИЛИ",
	//"Пользователи","Т2.Пользователь",")", 
	//"","","", "","","", "","","", "","","", "","","", "","","", "","","", "","","", "","","")
	
	// Изменение
	//#ПоЗначениямРасширенный( "Задача.ЗадачиПользователя", "", "",
	//"",
	//"",
	//"Пользователи","Т.Инициатор","ИЛИ",
	//"Пользователи","Т.ПолучательУслуг","ИЛИ",
	//"Пользователи","Т.Исполнитель","ИЛИ",
	//"Пользователи","Т.ГруппаИсполнителейЗадач","", "","","", "","","", "","","", "","","", "","","", "","","", "","","", "","","", "","","", "","","", "","","", "","","")
	
	// Изменять может: Инициатор, Исполнитель, Роль (ГруппаИсполнителейЗадач)
	// Рабочая группа не может изменять. Только чтение. 
	// АПК:246-вкл Подсказка для прав
	
	Ограничение.Текст =
	"	ПрисоединитьДополнительныеТаблицы
	|	ЭтотСписок КАК ЭтотСписок
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачиПользователя.РабочаяГруппа КАК РабочаяГруппаЗадачи 
	|	    ПО РабочаяГруппаЗадачи.Ссылка = ЭтотСписок.Ссылка
	|	;
	|	РазрешитьЧтение
	|	ГДЕ
	|	    ЗначениеРазрешено(Проект.Организация)
	|	    И ЗначениеРазрешено(Проект)
	|	 И (  ЗначениеРазрешено(Инициатор)
	|		  ИЛИ ЗначениеРазрешено(ПолучательУслуг)
	|		  ИЛИ ЗначениеРазрешено(Исполнитель) 
	|		  ИЛИ ЗначениеРазрешено(РабочаяГруппаЗадачи.Пользователь)
	|		  ИЛИ ЗначениеРазрешено(ГруппаИсполнителейЗадач) 
	|		  ИЛИ РольДоступна(КонтрольЗадачПользователей)
	|)
	|	;
	|	РазрешитьИзменениеЕслиРазрешеноЧтение
	|	ГДЕ
	|		  ЗначениеРазрешено(Инициатор)
	|		  ИЛИ ЗначениеРазрешено(ПолучательУслуг)
	|		  ИЛИ ЗначениеРазрешено(Исполнитель)
	|		  ИЛИ ЗначениеРазрешено(ГруппаИсполнителейЗадач)
	|		  ИЛИ РольДоступна(КонтрольЗадачПользователей)
	|	
	|";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Печать карточки задачи
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "КарточкаЗадачи";
	КомандаПечати.Представление = НСтр("ru = 'Печать карточки задачи'");

КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КарточкаЗадачи") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"КарточкаЗадачи",
			НСтр("ru = 'Печать карточки задачи'"),
			ПечатьКарточкиЗадачи(МассивОбъектов, ОбъектыПечати));
				
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ШаблоныСообщений

// Вызывается при подготовке шаблонов сообщений и позволяет переопределить список реквизитов и вложений.
//
// Параметры:
//  Реквизиты               - ДеревоЗначений - список реквизитов шаблона.
//         ** Имя            - Строка - Уникальное имя общего реквизита.
//         ** Представление  - Строка - Представление общего реквизита.
//         ** Тип            - Тип    - Тип реквизита. По умолчанию строка.
//         ** Формат         - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//  Вложения                - ТаблицаЗначений - печатные формы и вложения
//         ** Имя            - Строка - Уникальное имя вложения.
//         ** Представление  - Строка - Представление варианта.
//         ** ТипФайла       - Строка - Тип вложения: "pdf", "png", "jpg", mxl" и др.
//  ДополнительныеПараметры - Структура - дополнительные сведения о шаблоне сообщений.
//
Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Вызывается в момент создания сообщений по шаблону для заполнения значений реквизитов и вложений.
//
// Параметры:
//  Сообщение - Структура - структура с ключами:
//    * ЗначенияРеквизитов - Соответствие - список используемых в шаблоне реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * ЗначенияОбщихРеквизитов - Соответствие - список используемых в шаблоне общих реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * Вложения - Соответствие - значения реквизитов 
//      ** Ключ     - Строка - имя вложения в шаблоне;
//      ** Значение - ДвоичныеДанные, Строка - двоичные данные или адрес во временном хранилище вложения.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект являющийся источником данных.
//  ДополнительныеПараметры - Структура -  Дополнительная информация о шаблоне сообщения.
//
Процедура ПриФормированииСообщения(Сообщение, ПредметСообщения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Заполняет список получателей SMS при отправке сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиSMS - ТаблицаЗначений - список получается SMS.
//     * НомерТелефона - Строка - номер телефона, куда будет отправлено сообщение SMS.
//     * Представление - Строка - представление получателя сообщения SMS.
//     * Контакт       - Произвольный - контакт, которому принадлежит номер телефона.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.//
//
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, ПредметСообщения) Экспорт
	
КонецПроцедуры

// Заполняет список получателей письма при отправки сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиПисьма - ТаблицаЗначений - список получается письма.
//     * Адрес           - Строка - адрес электронной почты получателя.
//     * Представление   - Строка - представление получается письма.
//     * Контакт         - Произвольный - контакт, которому принадлежит адрес электронной почты.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//                                              если шаблон содержит произвольные параметры:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.
//
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, ПредметСообщения) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ШаблоныСообщений

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

//////////////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ЗАДАЧАМИ

Функция ЕстьДоступНаВыполненияЗадачи(РеквизитыЗадачи) 
	
	// Если пользователь не является ни автором, ни исполнителем, то выполнить задачу нельзя.
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Если РеквизитыЗадачи.Исполнитель <> ТекущийПользователь 
		И РеквизитыЗадачи.Инициатор <> ТекущийПользователь 
		И Не РаботаСЗадачами.ЭтоПолноправныйПользовательЗадач() Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецЕсли
